Stebym/stm32-course-jiroserob/examen_parcial/Src/main.c
/**
 ******************************************************************************
 * @file    : main.c
 * @author  : Jimmy Stebym Rosero Barrera
 * @brief   : Examen Parcial (25%) - Taller V (2.0), 1er Semestre 2026
 * Profesor: Nerio Andres Montoya Giraldo, PhD.
 * Nucleo-F411RE (STM32F411RETx). Sensor sorteado: Joystick analogico.
 * Display sorteado: OLED GME12864-41 (I2C, controlador SSD1315).
 *
 * ------------------------------------------------------------------------
 * QUE HACE ESTE PROGRAMA
 * ------------------------------------------------------------------------
 * Resuelve las 6 preguntas tecnicas del examen (la 7ma es la sustentacion
 * oral) usando una FSM de 4 estados, todo HAL puro sin CubeMX:
 *   1. LED de estado parpadeando a 250 ms exactos (TIM10, interrupcion).
 *   2. OLED GME12864-41 por I2C1, polling (el enunciado exige que I2C NO
 *      use interrupciones), mostrando hora RTC, joystick X/Y y estado FSM.
 *   3. USART2 115200 8N1, Rx por interrupcion, con 5 comandos verificables:
 *      'H'/'L'/'P' (fuente de MCO1), 'T' (ajustar hora RTC), 'R' (reporte).
 *   4. Joystick analogico (ADC1, 2 canales en modo Scan disparado cada
 *      20 ms por TIM3_TRGO, lectura por interrupcion, sin DMA).
 *   5. RTC interno con LSE (cristal 32.768 kHz de la board) + VBAT, para
 *      que la hora sobreviva al desconectar la alimentacion principal.
 *   6. SYSCLK a 100 MHz (PLL desde HSI) verificable en MCO1 (PA8): HSI,
 *      LSE o PLL segun el comando serial recibido.
 *
 * ------------------------------------------------------------------------
 * MAPA DE PINES
 * ------------------------------------------------------------------------
 * Pin   Funcion              Modo              Notas
 * PA0   SW Joystick (click)  EXTI falling      pull-up interno, sale de ESTADO_BIENVENIDA
 * PA1   ADC1_IN1  Joystick Y Analogico         VRy
 * PA2   USART2_TX            AF7               hacia PC (ST-Link VCP)
 * PA3   USART2_RX            AF7 + PullUp      evita flancos falsos en reposo
 * PA4   ADC1_IN4  Joystick X Analogico         VRx -- separado de PA1 (no adyacentes)
 * PA5   LED Blinky Nucleo    Salida PP         toggle cada 250 ms (TIM10)
 * PA8   MCO1                 AF0               HSI / LSE / PLL segun comando
 * PB8   I2C1_SCL  OLED       AF4 open-drain    GME12864-41
 * PB9   I2C1_SDA  OLED       AF4 open-drain    GME12864-41
 * PC13  Boton azul B1 board  Entrada           no usado por ahora (libre)
 *
 * ------------------------------------------------------------------------
 * RELOJES
 * ------------------------------------------------------------------------
 * HSI 16 MHz -> PLL (M=8, N=200, P=4) -> SYSCLK = 100 MHz
 *   VCO_in  = 16 MHz / 8   = 2 MHz    (rango recomendado 1-2 MHz)
 *   VCO_out = 2 MHz  x 200 = 400 MHz  (rango valido 192-432 MHz)
 *   PLLCLK  = 400 MHz / 4  = 100 MHz
 * AHB  (HCLK)  = SYSCLK / 1 = 100 MHz
 * APB1 (PCLK1) = HCLK   / 2 =  50 MHz (limite APB1 = 50 MHz)
 * APB2 (PCLK2) = HCLK   / 1 = 100 MHz (limite APB2 = 100 MHz)
 * Flash latency = 3 wait states (obligatorio para 100 MHz a 2.7-3.6 V)
 * Con APB1 y APB2 en prescaler != 1 y ==1 respectivamente, TIMx alcanza
 * 100 MHz en ambos buses (regla: si el prescaler APB no es 1, el reloj del
 * timer se dobla respecto al PCLK correspondiente).
 *
 * ------------------------------------------------------------------------
 * LOS TIMERS
 * ------------------------------------------------------------------------
 *   TIM10 - blinky de estado. PSC=9999 (tick=100us) ARR=2499 -> periodo
 *           exacto de 250 ms. Interrupcion de update, alterna PA5.
 *   TIM3  - generador de disparo (TRGO) para el ADC1 cada 20 ms (50 Hz).
 *           Configurado como timer base con MasterOutputTrigger=UPDATE.
 *           No genera ninguna interrupcion propia ni senal visible; el
 *           F411 SI soporta TIM3_TRGO como fuente externa del ADC1 (a
 *           diferencia de TIM4, que no la tiene).
 *
 * ------------------------------------------------------------------------
 * ADC1 (joystick, canales 1 y 4 en modo Scan)
 * ------------------------------------------------------------------------
 * Resolucion 12 bits, Scan Mode con 2 conversiones (rank1=CH1=Y en PA1,
 * rank2=CH4=X en PA4 -- se separaron a pines NO adyacentes porque con
 * PA0/PA1 aparecia continuidad electrica entre los dos ejes en el
 * cableado fisico), disparadas por TIM3_TRGO, EOC individual por cada
 * canal (EOC_SINGLE_CONV, sin DMA). El callback HAL_ADC_ConvCpltCallback
 * usa un contador de rank para saber cual de los dos ejes llego; solo se
 * re-arma HAL_ADC_Start_IT() despues del ULTIMO canal de la secuencia
 * (rank2), igual que se rearma el ADC de un solo canal en Tarea 3, para
 * que el proximo TIM3_TRGO dispare la secuencia completa otra vez desde
 * el rank1 (Y).
 *
 * ------------------------------------------------------------------------
 * USART2 (5 comandos individuales, caracteres sueltos)
 * ------------------------------------------------------------------------
 *   'H'/'h' -> MCO1 = HSI  (16 MHz sin dividir)
 *   'L'/'l' -> MCO1 = LSE  (32.768 kHz sin dividir)
 *   'P'/'p' -> MCO1 = PLL  (100 MHz / 4 = 25 MHz, prescaler para que sea
 *              medible con seguridad en el osciloscopio del laboratorio)
 *   'T'/'t' -> entra a ESTADO_CONFIG_RTC: pide "HH:MM:SS" por teclado y
 *              actualiza el RTC.
 *   'R'/'r' -> imprime por consola un reporte con hora RTC, joystick X/Y
 *              y la fuente de reloj activa en MCO1.
 * La recepcion es por interrupcion (1 byte, re-armada en el callback); la
 * transmision es por polling.
 *
 * ------------------------------------------------------------------------
 * RTC INTERNO + LSE + VBAT
 * ------------------------------------------------------------------------
 * Fuente de reloj RTC = LSE (cristal 32.768 kHz soldado en la Nucleo).
 * AsynchPrediv=127, SynchPrediv=255 -> (127+1)x(255+1)=32768 -> 1 Hz exacto.
 * Para que el RTC seguir funcionando sin la alimentacion principal (USB),
 * el pin VBAT debe conectarse a una pila CR2032 de 3V: la region de
 * backup del micro (dominio RTC + registros BKP) queda energizada por esa
 * pila aunque se desconecte VDD. En software, se usa el registro de backup
 * RTC_BKP_DR0 como "bandera de primer arranque": solo se fija fecha/hora
 * por defecto la primera vez (o si la pila se agoto y se perdio el
 * backup); en resets posteriores el RTC ya viene corriendo solo y no se
 * pisa la hora real.
 *
 * ------------------------------------------------------------------------
 * LA FSM (4 estados)
 * ------------------------------------------------------------------------
 *   ESTADO_INICIALIZACION -> arranca relojes (100 MHz), RTC, ADC, OLED.
 *   ESTADO_BIENVENIDA      -> pantalla de arranque ("Presione click para
 *                             iniciar"); se queda aca, sin leer/mostrar
 *                             joystick ni hora, hasta el primer click del
 *                             boton SW del joystick (PA0, EXTI).
 *   ESTADO_MONITOR         -> refresca el OLED con hora/joystick/estado,
 *                             procesa comandos H/L/P/R de una, y salta a
 *                             CONFIG_RTC si llega 'T'.
 *   ESTADO_CONFIG_RTC      -> pausa el refresco de joystick en pantalla,
 *                             muestra un prompt y arma "HH:MM:SS" caracter
 *                             a caracter hasta un ENTER, corrige el RTC y
 *                             regresa a MONITOR.
 *
 * ------------------------------------------------------------------------
 * BOTON SW DEL JOYSTICK (click central, PA0, EXTI por interrupcion)
 * ------------------------------------------------------------------------
 * No lo pide la rubrica, se agrega como detalle extra: su unico trabajo es
 * sacar la FSM de ESTADO_BIENVENIDA hacia ESTADO_MONITOR con el primer
 * click. Fuera de ese estado no tiene efecto.
 * ******************************************************************************
 */

#include "stm32f4xx_hal.h"
#include "stm32f4xx_it.h"
#include "oled_display.h"
#include "tetris.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/* -----------------------------------------------------------------------
 * DEFINES
 * ----------------------------------------------------------------------- */

#define RTC_BKP_MAGIC   0x32F2U   /* marca de "el rtc ya fue inicializado" */

/* -----------------------------------------------------------------------
 * HANDLES HAL (manuales, sin CubeMX)
 * ----------------------------------------------------------------------- */

