Stebym/stm32-course-jiroserob/examen_parcial/Src/main.c
TIM_HandleTypeDef  htim10;  /* blinky 250 ms                 */
TIM_HandleTypeDef  htim3;   /* disparador del adc cada 20 ms  */
ADC_HandleTypeDef  hadc1;   /* joystick x/y                   */
UART_HandleTypeDef huart2;  /* consola de comandos            */
RTC_HandleTypeDef  hrtc;    /* reloj de tiempo real con lse    */

/* -----------------------------------------------------------------------
 * VARIABLES GLOBALES
 * ----------------------------------------------------------------------- */

/* joystick: lecturas de 12 bits (0-4095) ya filtradas (ver HAL_ADC_ConvCpltCallback) */
volatile uint16_t joystick_x = 2048;
volatile uint16_t joystick_y = 2048;
static uint8_t    adc_rank_actual = 0;   /* 0 = esperando x, 1 = esperando y */

/* filtro pasa-bajos exponencial (promedio movil): suaviza picos de una sola
 * muestra causados por ruido electrico o un punto sucio del potenciometro.
 * filtro += (crudo - filtro) / N -- N mas grande = mas suave pero mas lento
 * para responder a un movimiento real del joystick */
#define ADC_FILTRO_N  4
static int32_t filtro_adc_x = 2048;
static int32_t filtro_adc_y = 2048;

/* zona muerta: si la lectura (ya filtrada) esta a +-150 cuentas del centro
 * teorico (2048), se fuerza al centro exacto. Se aplica sobre joystick_x/
 * joystick_y directamente -- afecta por igual al reporte 'R', a los
 * numeros del OLED y al cursor, para que se vea perfectamente quieto en
 * reposo y solo cambie cuando el joystick se mueve de verdad */
#define JOY_CENTRO       2048
#define JOY_ZONA_MUERTA   150

/* recepcion serial de 1 byte por interrupcion */
uint8_t          rx_data[1];
volatile uint8_t serial_nuevo = 0;

/* buffer de edicion para el comando 'T' (ajustar hora) */
#define RTC_INPUT_MAXLEN 16
static char    rtc_input_buffer[RTC_INPUT_MAXLEN + 1];
static uint8_t rtc_input_len = 0;

/* fuente activa de mco1, solo para mostrar en pantalla/reporte */
typedef enum { MCO_FUENTE_HSI = 0, MCO_FUENTE_LSE, MCO_FUENTE_PLL } MCO_Fuente_t;
static MCO_Fuente_t mco_fuente_actual = MCO_FUENTE_HSI;

/* boton sw del joystick (click central, pc0, exti por flanco de bajada) */
#define SW_DEBOUNCE_MS      200U   /* ignora rebotes/reclicks mas rapidos que esto */
volatile uint8_t boton_sw_pulsado = 0;   /* la isr la levanta, el loop la consume */
static uint32_t  tick_ultimo_click = 0;  /* para el debounce dentro de la isr     */

/* comando 'R' en modo continuo: solo transmite un reporte nuevo cuando el
 * joystick realmente cambio (chequeado cada 300 ms) -- evita inundar la
 * consola con lineas identicas mientras esta quieto (zona muerta) */
static uint8_t  reporte_continuo = 0;
static uint32_t tick_ultimo_reporte_continuo = 0;
static uint16_t ultimo_reporte_x = 0xFFFF; /* valor imposible: fuerza el primer envio */
static uint16_t ultimo_reporte_y = 0xFFFF;

/* ajuste de hora con el joystick dentro de ESTADO_CONFIG_RTC:
 * eje Y (arriba/abajo) mueve minutos, eje X (izq/der) mueve horas.
 * cada paso es "por flanco" -- hay que volver al centro antes de que
 * cuente el siguiente paso, para no incrementar sin control */
#define JOY_CENTRO_MIN   1700U
#define JOY_CENTRO_MAX   2400U
#define JOY_UMBRAL_ALTO  3200U
#define JOY_UMBRAL_BAJO   900U
static uint8_t joy_listo_paso_min  = 1;
static uint8_t joy_listo_paso_hora = 1;
/* mismos umbrales/logica de "por flanco" reutilizados en ESTADO_CONFIG_FECHA:
 * joy_listo_paso_hora -> eje X -> dia, joy_listo_paso_min -> eje Y -> mes */

/* estados de la maquina de estados finita (fsm) */
typedef enum {
    ESTADO_INICIALIZACION = 0,
    ESTADO_BIENVENIDA,
    ESTADO_MONITOR,
    ESTADO_CONFIG_RTC,
    ESTADO_CONFIG_FECHA,
    ESTADO_TETRIS /* easter egg, no forma parte de la rubrica -- ver tetris.c */
} FSM_Estado_t;

/* codigo secreto: 5 clicks del joystick separados por menos de 2s c/u,
 * alterna MONITOR <-> TETRIS. vive aca (no en tetris.c) porque necesita
 * mirar/cambiar estado_fsm directamente */
#define SECRETO_VENTANA_MS  2000U
#define SECRETO_CLICKS       3U
static uint32_t tick_ultimo_click_secreto = 0;
static uint8_t  clicks_secreto = 0;

FSM_Estado_t estado_fsm = ESTADO_INICIALIZACION;

/* -----------------------------------------------------------------------
 * PROTOTIPOS
 * ----------------------------------------------------------------------- */

static void SystemClock_Config(void);
static void GPIO_Init_Manual(void);
static void TIM10_Blinky_Init(void);
static void TIM3_ADCTrigger_Init(void);
static void ADC1_Joystick_Init(void);
static void UART2_Init_Manual(void);
static void RTC_Init_Manual(void);
static void MCO1_SetSource(MCO_Fuente_t fuente);
static const char *MCO_FuenteTexto(MCO_Fuente_t fuente);
static void Procesar_Comando(char c);
static void Enviar_Reporte(void);
static void Enviar_Menu_Ayuda(void);
static void OLED_ActualizarMonitor(void);
static void OLED_ActualizarConfigRTC(void);
static void OLED_ActualizarConfigFecha(void);
static void OLED_MostrarBienvenida(void);
static void RTC_AplicarEntradaUsuario(void);
static void RTC_AjustarConJoystick(void);
static void RTC_AplicarFechaTecleada(void);
static void RTC_AjustarFechaConJoystick(void);
static void Inicializar_Hardware(void);

/* -----------------------------------------------------------------------
 * LOGICA PRINCIPAL
 * ----------------------------------------------------------------------- */

int main(void)
{
    HAL_Init();

    /* la fsm arranca en INICIALIZACION: monta todo el hardware una sola vez */
    Inicializar_Hardware();
    estado_fsm = ESTADO_BIENVENIDA;
    OLED_MostrarBienvenida(); /* pantalla estatica, se dibuja una sola vez */

    uint32_t tick_ultima_pantalla = 0;
    uint32_t tick_menu_previo     = 0;

    while (1)
    {
        /* codigo secreto (easter egg): 3 clicks rapidos (<2s entre cada
         * uno) alternan MONITOR <-> TETRIS.
         * OJO: en ESTADO_MONITOR hay que consumir boton_sw_pulsado SIEMPRE
         * aca (nadie mas lo lee en ese estado) -- si no, el mismo click
         * fisico se sigue viendo en cada vuelta del while(1) (que da miles
         * de vueltas por segundo) y el contador llega al umbral casi
         * instantaneo con un solo click real. En ESTADO_TETRIS en cambio
         * NO se limpia aca: se deja para que el case de abajo lo use ese
         * mismo ciclo (rota la pieza) y lo limpie el una sola vez. */
        if (boton_sw_pulsado && (estado_fsm == ESTADO_MONITOR || estado_fsm == ESTADO_TETRIS))
        {
            uint32_t ahora_click = HAL_GetTick();
            if ((ahora_click - tick_ultimo_click_secreto) < SECRETO_VENTANA_MS)
            {
                clicks_secreto++;
            }
            else
            {
                clicks_secreto = 1;
            }
            tick_ultimo_click_secreto = ahora_click;

            if (estado_fsm == ESTADO_MONITOR)
            {
                boton_sw_pulsado = 0;
            }

            if (clicks_secreto >= SECRETO_CLICKS)
            {
                clicks_secreto = 0;
                boton_sw_pulsado = 0; /* este click ya se uso para el toggle, no debe rotar pieza */

                if (estado_fsm == ESTADO_MONITOR)
                {
                    estado_fsm = ESTADO_TETRIS;
                    Tetris_Iniciar();
                }
                else
                {
                    estado_fsm = ESTADO_MONITOR;
                    tick_ultima_pantalla = 0;
                    tick_menu_previo     = HAL_GetTick();
                }
            }
        }

        switch (estado_fsm)
        {
            case ESTADO_INICIALIZACION:
                /* no deberia volver a caer aca; por seguridad, reinicializa */
                Inicializar_Hardware();
                estado_fsm = ESTADO_BIENVENIDA;
                OLED_MostrarBienvenida();
                break;

