Stebym/stm32-course-jiroserob/examen_parcial/Src/main.c
            case ESTADO_BIENVENIDA:
                /* se queda aca, sin tocar el oled de nuevo, hasta el primer click */
                if (boton_sw_pulsado)
                {
                    boton_sw_pulsado = 0;
                    estado_fsm = ESTADO_MONITOR;
                    tick_ultima_pantalla = 0; /* fuerza el primer refresco del monitor de una */
                    tick_menu_previo     = HAL_GetTick(); /* arranca el conteo de los 30s aqui */
                }
                break;

            case ESTADO_MONITOR:
                if (serial_nuevo)
                {
                    serial_nuevo = 0;
                    Procesar_Comando((char)rx_data[0]);
                }

                /* recordatorio periodico del menu de ayuda, cada 30 s */
                if ((HAL_GetTick() - tick_menu_previo) >= 30000U)
                {
                    Enviar_Menu_Ayuda();
                    tick_menu_previo = HAL_GetTick();
                }

                /* modo 'R' continuo: chequea cada 300 ms, pero SOLO transmite
                 * si el joystick cambio de verdad desde el ultimo envio --
                 * evita inundar la consola con lineas identicas en reposo */
                if (reporte_continuo && ((HAL_GetTick() - tick_ultimo_reporte_continuo) >= 300U))
                {
                    if (joystick_x != ultimo_reporte_x || joystick_y != ultimo_reporte_y)
                    {
                        Enviar_Reporte();
                        ultimo_reporte_x = joystick_x;
                        ultimo_reporte_y = joystick_y;
                    }
                    tick_ultimo_reporte_continuo = HAL_GetTick();
                }

                /* refresco del oled cada ~150 ms (evita saturar el bus i2c) */
                if ((HAL_GetTick() - tick_ultima_pantalla) >= 150U)
                {
                    OLED_ActualizarMonitor();
                    tick_ultima_pantalla = HAL_GetTick();
                }
                break;

            case ESTADO_CONFIG_RTC:
                if (serial_nuevo)
                {
                    serial_nuevo = 0;
                    char c = (char)rx_data[0];

                    if (c == '\r' || c == '\n')
                    {
                        RTC_AplicarEntradaUsuario();
                        rtc_input_len = 0;
                        rtc_input_buffer[0] = '\0';
                        estado_fsm = ESTADO_MONITOR;
                    }
                    else if ((c == 0x08 || c == 0x7F) && rtc_input_len > 0)
                    {
                        /* backspace: borra el ultimo caracter tecleado */
                        rtc_input_len--;
                        rtc_input_buffer[rtc_input_len] = '\0';
                    }
                    else if (rtc_input_len < RTC_INPUT_MAXLEN)
                    {
                        rtc_input_buffer[rtc_input_len++] = c;
                        rtc_input_buffer[rtc_input_len] = '\0';
                    }

                    OLED_ActualizarConfigRTC();
                }

                /* click del joystick: confirma/sale de config_rtc (alternativa al ENTER) */
                if (boton_sw_pulsado)
                {
                    boton_sw_pulsado = 0;
                    rtc_input_len = 0;
                    rtc_input_buffer[0] = '\0';
                    estado_fsm = ESTADO_MONITOR;
                }

                /* ajuste de hora con el joystick: X=minutos, Y=horas, por flanco
                 * (el modulo fisico queda rotado en la protoboard: el eje que
                 * se siente como "izquierda/derecha" es electricamente
                 * joystick_y, y el que se siente "arriba/abajo" es
                 * joystick_x -- mismo motivo por el que el cursor del oled
                 * necesita el intercambio px<-joystick_y / py<-joystick_x) */
                RTC_AjustarConJoystick();
                break;

            case ESTADO_CONFIG_FECHA:
                if (serial_nuevo)
                {
                    serial_nuevo = 0;
                    char c = (char)rx_data[0];

                    if (c == '\r' || c == '\n')
                    {
                        RTC_AplicarFechaTecleada();
                        rtc_input_len = 0;
                        rtc_input_buffer[0] = '\0';
                        estado_fsm = ESTADO_MONITOR;
                    }
                    else if ((c == 0x08 || c == 0x7F) && rtc_input_len > 0)
                    {
                        rtc_input_len--;
                        rtc_input_buffer[rtc_input_len] = '\0';
                    }
                    else if (rtc_input_len < RTC_INPUT_MAXLEN)
                    {
                        rtc_input_buffer[rtc_input_len++] = c;
                        rtc_input_buffer[rtc_input_len] = '\0';
                    }

                    OLED_ActualizarConfigFecha();
                }

                /* click del joystick: confirma/sale de config_fecha (alternativa al ENTER) */
                if (boton_sw_pulsado)
                {
                    boton_sw_pulsado = 0;
                    rtc_input_len = 0;
                    rtc_input_buffer[0] = '\0';
                    estado_fsm = ESTADO_MONITOR;
                }

                /* ajuste de fecha con el joystick: X=mes, Y=dia, por flanco
                 * (mismo motivo de rotacion fisica que en config_rtc) */
                RTC_AjustarFechaConJoystick();
                break;

            case ESTADO_TETRIS:
                /* easter egg: no forma parte de la rubrica. el bloque de
                 * arriba ya consumio el click si completaba el codigo de
                 * salida; si llega aca con boton_sw_pulsado=1 es porque
                 * el usuario solo dio un click normal (rota la pieza) */
                Tetris_Actualizar(joystick_x, joystick_y, boton_sw_pulsado);
                boton_sw_pulsado = 0;

                if (Tetris_DebeSalir())
                {
                    estado_fsm = ESTADO_MONITOR;
                    tick_ultima_pantalla = 0;
                    tick_menu_previo     = HAL_GetTick();
                }
                break;

            default:
                estado_fsm = ESTADO_MONITOR;
                break;
        }
    }
}

/* -----------------------------------------------------------------------
 * INICIALIZACION CENTRAL DE HARDWARE
 * ----------------------------------------------------------------------- */
void Inicializar_Hardware(void)
{
    SystemClock_Config();     /* sysclk a 100 mhz via pll                */
    GPIO_Init_Manual();
    MCO1_SetSource(MCO_FUENTE_HSI); /* arranca mostrando hsi por defecto  */

