Stebym/stm32-course-jiroserob/examen_parcial/Src/main.c
    RTC_Init_Manual();        /* rtc con lse + vbat                      */

    UART2_Init_Manual();      /* consola de comandos, 115200 8n1 (antes del
                                * oled: OLED_ScanAddress() necesita transmitir) */

    OLED_I2C1_Init();         /* i2c1 polling, sin interrupciones        */
    OLED_ScanAddress(&huart2); /* detecta 0x78 vs 0x7A del jumper del modulo */
    SSD1306_Init();
    SSD1306_Fill(0);
    SSD1306_WriteString(0, 0, "Examen Parcial TallerV");
    SSD1306_UpdateScreen();

    TIM3_ADCTrigger_Init();   /* trigger del adc cada 20 ms              */
    ADC1_Joystick_Init();     /* joystick x/y en modo scan               */

    TIM10_Blinky_Init();      /* blinky de estado a 250 ms               */

    /* arranques de perifericos con interrupcion / disparo por hardware */
    HAL_TIM_Base_Start(&htim3);         /* solo genera el trgo, sin isr propia */
    HAL_ADC_Start_IT(&hadc1);
    HAL_TIM_Base_Start_IT(&htim10);
    HAL_UART_Receive_IT(&huart2, rx_data, 1);

    Enviar_Menu_Ayuda(); /* banner de comandos disponibles, una vez al arrancar */
}

/* -----------------------------------------------------------------------
 * SYSCLK A 100 MHZ (PLL DESDE HSI)
 * ----------------------------------------------------------------------- */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    __HAL_RCC_PWR_CLK_ENABLE();

    RCC_OscInitStruct.OscillatorType      = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState            = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState        = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource       = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM            = 8;    /* vco_in  = 16MHz/8   = 2MHz   */
    RCC_OscInitStruct.PLL.PLLN            = 200;  /* vco_out = 2MHz*200  = 400MHz */
    RCC_OscInitStruct.PLL.PLLP            = RCC_PLLP_DIV4; /* sysclk = 400/4 = 100MHz */
    RCC_OscInitStruct.PLL.PLLQ            = 4;    /* usb/sdio, no se usa aqui, valor valido */
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK |
                                        RCC_CLOCKTYPE_PCLK1  | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;  /* hclk  = 100 mhz */
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;    /* pclk1 =  50 mhz (limite apb1) */
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;    /* pclk2 = 100 mhz (limite apb2) */

    /* 3 wait states: obligatorios en la f411 para 100 mhz a 2.7-3.6 v */
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3);
}

/* -----------------------------------------------------------------------
 * GPIO
 * ----------------------------------------------------------------------- */
static void GPIO_Init_Manual(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();

    /* pa5: led de estado (blinky) */
    GPIO_InitStruct.Pin   = GPIO_PIN_5;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* ph1: led espejo del blinky en una placa auxiliar (mismo patron que
     * Tarea 3) -- no lo pide la rubrica, pero el micro va a quedar tapado
     * y este led sí queda visible para la sustentacion */
    __HAL_RCC_GPIOH_CLK_ENABLE();
    GPIO_InitStruct.Pin   = GPIO_PIN_1;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

    /* pa1/pa4: entradas analogicas del joystick (pa1=vry, pa4=vrx). Se separaron
     * a pines NO vecinos (antes eran pa0/pa1, adyacentes en el header) porque
     * con pa0/pa1 aparecia continuidad electrica entre los dos ejes en el
     * cableado fisico -- pa1/pa4 no comparten header ni posicion adyacente,
     * asi que un roce accidental entre los dos cables es mucho mas dificil */
    GPIO_InitStruct.Pin  = GPIO_PIN_1 | GPIO_PIN_4;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* pa2: usart2 tx, af7 */
    GPIO_InitStruct.Pin       = GPIO_PIN_2;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* pa3: usart2 rx, af7, pullup obligatorio para evitar flancos falsos */
    GPIO_InitStruct.Pin  = GPIO_PIN_3;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* pa8: salida de reloj mco1 */
    GPIO_InitStruct.Pin       = GPIO_PIN_8;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF0_MCO;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* pa0: click (sw) del joystick, entrada con interrupcion por flanco de
     * bajada (activo en bajo) -- sin resistencia externa, se resuelve solo
     * con el pull-up interno del micro (GPIO_PULLUP). Antes vivia en pc0;
     * se movio a pa0 (libre, ya que vrx/vry se movieron a pa1/pa4) */
    GPIO_InitStruct.Pin   = GPIO_PIN_0;
    GPIO_InitStruct.Mode  = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull  = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(EXTI0_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(EXTI0_IRQn);
}

/* -----------------------------------------------------------------------
 * TIM10: BLINKY DE ESTADO A 250 MS
 * ----------------------------------------------------------------------- */
static void TIM10_Blinky_Init(void)
{
    __HAL_RCC_TIM10_CLK_ENABLE();

    htim10.Instance               = TIM10;
    htim10.Init.Prescaler         = 9999;   /* 100mhz/10000 = 10khz -> tick de 100us */
    htim10.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim10.Init.Period            = 2499;   /* 2500 ticks x 100us = 250 ms exactos   */
    htim10.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim10.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    HAL_TIM_Base_Init(&htim10);

    HAL_NVIC_SetPriority(TIM1_UP_TIM10_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(TIM1_UP_TIM10_IRQn);
}

/* -----------------------------------------------------------------------
 * TIM3: DISPARADOR (TRGO) DEL ADC1 CADA 20 MS
 * ----------------------------------------------------------------------- */
static void TIM3_ADCTrigger_Init(void)
{
    __HAL_RCC_TIM3_CLK_ENABLE();

    htim3.Instance               = TIM3;
    htim3.Init.Prescaler         = 9999;  /* 100mhz/10000 = 10khz -> tick de 100us */
    htim3.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim3.Init.Period            = 199;   /* 200 ticks x 100us = 20 ms exactos     */
    htim3.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    HAL_TIM_Base_Init(&htim3);

