Stebym/stm32-course-jiroserob/examen_parcial/Src/main.c
    /* trgo en el evento de update: es lo que el adc1 usa como disparo externo */
    TIM_MasterConfigTypeDef sMasterConfig = {0};
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE;
    sMasterConfig.MasterSlaveMode     = TIM_MASTERSLAVEMODE_DISABLE;
    HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig);
}

/* -----------------------------------------------------------------------
 * ADC1: JOYSTICK X/Y (CH1=PA1=Y, CH4=PA4=X) EN MODO SCAN
 * ----------------------------------------------------------------------- */
static void ADC1_Joystick_Init(void)
{
    ADC_ChannelConfTypeDef sConfig = {0};
    __HAL_RCC_ADC1_CLK_ENABLE();

    hadc1.Instance                   = ADC1;
    hadc1.Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc1.Init.Resolution            = ADC_RESOLUTION_12B;
    hadc1.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
    hadc1.Init.ScanConvMode          = ENABLE;   /* 2 canales: x y y */
    hadc1.Init.ContinuousConvMode    = DISABLE;  /* solo convierte cuando tim3 avisa */
    hadc1.Init.DiscontinuousConvMode = DISABLE;
    hadc1.Init.NbrOfConversion       = 2;
    hadc1.Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T3_TRGO;
    hadc1.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_RISING;
    hadc1.Init.DMAContinuousRequests = DISABLE;
    hadc1.Init.EOCSelection          = ADC_EOC_SINGLE_CONV; /* interrupcion por cada canal */
    HAL_ADC_Init(&hadc1);

    HAL_NVIC_SetPriority(ADC_IRQn, 3, 0);
    HAL_NVIC_EnableIRQ(ADC_IRQn);

    /* rank 1: eje y (pa1, canal 1) */
    sConfig.Channel      = ADC_CHANNEL_1;
    sConfig.Rank         = 1;
    sConfig.SamplingTime = ADC_SAMPLETIME_480CYCLES; /* maximo posible: le da tiempo de
        sobra al capacitor interno de muestreo para "olvidar" el voltaje del canal
        anterior antes de convertir el siguiente -- evita crosstalk entre canales.
        Con 2 canales x 480 ciclos a 25MHz de reloj adc, la secuencia completa dura
        ~40us, insignificante frente a los 20ms entre disparos del TIM3 */
    sConfig.Offset       = 0;
    HAL_ADC_ConfigChannel(&hadc1, &sConfig);

    /* rank 2: eje x (pa4, canal 4) */
    sConfig.Channel = ADC_CHANNEL_4;
    sConfig.Rank    = 2;
    HAL_ADC_ConfigChannel(&hadc1, &sConfig);
}

/* -----------------------------------------------------------------------
 * USART2: CONSOLA DE COMANDOS
 * ----------------------------------------------------------------------- */
static void UART2_Init_Manual(void)
{
    __HAL_RCC_USART2_CLK_ENABLE();

    huart2.Instance          = USART2;
    huart2.Init.BaudRate     = 115200;
    huart2.Init.WordLength   = UART_WORDLENGTH_8B;
    huart2.Init.StopBits     = UART_STOPBITS_1;
    huart2.Init.Parity       = UART_PARITY_NONE;
    huart2.Init.Mode         = UART_MODE_TX_RX;
    huart2.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart2);

    HAL_NVIC_SetPriority(USART2_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(USART2_IRQn);
}

/* -----------------------------------------------------------------------
 * RTC: LSE + VBAT, CON DETECCION DE PRIMER ARRANQUE
 * ----------------------------------------------------------------------- */
static void RTC_Init_Manual(void)
{
    RCC_OscInitTypeDef        RCC_OscInitStruct = {0};
    RCC_PeriphCLKInitTypeDef  PeriphClkInit = {0};

    HAL_PWR_EnableBkUpAccess(); /* obligatorio para tocar el dominio de backup (rtc/bkp) */

    /* enciende el cristal externo lse de 32.768 khz de la board */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSE;
    RCC_OscInitStruct.LSEState       = RCC_LSE_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_NONE;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    /* el rtc toma su reloj del lse, no del lsi ni del hse dividido */
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
    PeriphClkInit.RTCClockSelection    = RCC_RTCCLKSOURCE_LSE;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

    __HAL_RCC_RTC_ENABLE();

    hrtc.Instance            = RTC;
    hrtc.Init.HourFormat     = RTC_HOURFORMAT_24;
    hrtc.Init.AsynchPrediv   = 127; /* (127+1)x(255+1) = 32768 -> reloj interno a 1 hz */
    hrtc.Init.SynchPrediv    = 255;
    hrtc.Init.OutPut         = RTC_OUTPUT_DISABLE;
    hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
    hrtc.Init.OutPutType     = RTC_OUTPUT_TYPE_OPENDRAIN;
    HAL_RTC_Init(&hrtc);

    /* si el registro de backup no tiene la marca, es la primera vez que
     * este rtc arranca (o se le agoto la pila de respaldo): se pone una
     * fecha/hora de arranque por defecto. en resets posteriores (con vbat
     * puesto) el rtc ya viene corriendo solo y esto se salta, para no
     * pisar la hora real con el valor por defecto. */
    if (HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0) != RTC_BKP_MAGIC)
    {
        RTC_TimeTypeDef sTime = {0};
        RTC_DateTypeDef sDate = {0};

        sTime.Hours   = 0;
        sTime.Minutes = 0;
        sTime.Seconds = 0;
        HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);

        sDate.WeekDay = RTC_WEEKDAY_MONDAY;
        sDate.Month   = RTC_MONTH_JANUARY;
        sDate.Date    = 1;
        sDate.Year    = 26; /* 2026 */
        HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN);

        HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, RTC_BKP_MAGIC);
    }
}

/* -----------------------------------------------------------------------
 * MCO1: CAMBIO DE FUENTE DE RELOJ VISIBLE EN PA8
 * ----------------------------------------------------------------------- */
static void MCO1_SetSource(MCO_Fuente_t fuente)
{
    switch (fuente)
    {
        case MCO_FUENTE_HSI:
            HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSI, RCC_MCODIV_1); /* 16 MHz */
            break;
        case MCO_FUENTE_LSE:
            HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_LSE, RCC_MCODIV_1); /* 32.768 kHz */
            break;
        case MCO_FUENTE_PLL:
            /* pll = 100 mhz; se divide entre 4 (25 mhz) para verlo limpio y
             * seguro en el osciloscopio del laboratorio */
            HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_PLLCLK, RCC_MCODIV_4);
            break;
    }
    mco_fuente_actual = fuente;
}

