Stebym/stm32-course-jiroserob/examen_parcial/Src/main.c
static const char *MCO_FuenteTexto(MCO_Fuente_t fuente)
{
    switch (fuente)
    {
        case MCO_FUENTE_HSI: return "HSI 16MHz";
        case MCO_FUENTE_LSE: return "LSE 32.768kHz";
        case MCO_FUENTE_PLL: return "PLL 100MHz/4";
        default:             return "?";
    }
}

/* -----------------------------------------------------------------------
 * COMANDOS DE LA CONSOLA SERIAL (6 comandos individuales verificables)
 * ----------------------------------------------------------------------- */
static void Procesar_Comando(char c)
{
    char msg[40];

    switch (c)
    {
        case 'H': case 'h':
            MCO1_SetSource(MCO_FUENTE_HSI);
            snprintf(msg, sizeof(msg), "-> MCO1: %s\r\n", MCO_FuenteTexto(mco_fuente_actual));
            HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), 100);
            break;
        case 'L': case 'l':
            MCO1_SetSource(MCO_FUENTE_LSE);
            snprintf(msg, sizeof(msg), "-> MCO1: %s\r\n", MCO_FuenteTexto(mco_fuente_actual));
            HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), 100);
            break;
        case 'P': case 'p':
            MCO1_SetSource(MCO_FUENTE_PLL);
            snprintf(msg, sizeof(msg), "-> MCO1: %s\r\n", MCO_FuenteTexto(mco_fuente_actual));
            HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), 100);
            break;
        case 'T': case 't':
            rtc_input_len = 0;
            rtc_input_buffer[0] = '\0';
            joy_listo_paso_min  = 1;
            joy_listo_paso_hora = 1;
            estado_fsm = ESTADO_CONFIG_RTC;
            OLED_ActualizarConfigRTC();
            HAL_UART_Transmit(&huart2, (uint8_t *)
                "-> Escriba HH:MM:SS y ENTER, o mueva el joystick\r\n"
                "   (X=minutos, Y=horas, click=salir)\r\n", 88, 100);
            break;
        case 'F': case 'f':
            rtc_input_len = 0;
            rtc_input_buffer[0] = '\0';
            joy_listo_paso_min  = 1;
            joy_listo_paso_hora = 1;
            estado_fsm = ESTADO_CONFIG_FECHA;
            OLED_ActualizarConfigFecha();
            HAL_UART_Transmit(&huart2, (uint8_t *)
                "-> Escriba DD/MM/YY y ENTER, o mueva el joystick\r\n"
                "   (X=mes, Y=dia, click=salir)\r\n", 82, 100);
            break;
        case 'R': case 'r':
            reporte_continuo = !reporte_continuo;
            if (reporte_continuo)
            {
                HAL_UART_Transmit(&huart2, (uint8_t *)
                    "-> Reporte CONTINUO activado (manda 'R' de nuevo para apagarlo)\r\n", 67, 100);
                tick_ultimo_reporte_continuo = 0; /* fuerza el chequeo inmediato */
                ultimo_reporte_x = 0xFFFF; /* fuerza que el primer chequeo cuente como "cambio" */
                ultimo_reporte_y = 0xFFFF;
            }
            else
            {
                HAL_UART_Transmit(&huart2, (uint8_t *)"-> Reporte continuo apagado\r\n", 30, 100);
            }
            break;
        default:
            /* tecla no reconocida: reimprime el menu de ayuda */
            Enviar_Menu_Ayuda();
            break;
    }
}

/* -----------------------------------------------------------------------
 * MENU DE AYUDA POR CONSOLA (mismo patron que Tarea 3)
 * ----------------------------------------------------------------------- */
static void Enviar_Menu_Ayuda(void)
{
    static const char msg_ayuda[] =
            "\r\n"
            "==========================================================\r\n"
            "         EXAMEN PARCIAL TALLER V - CONSOLA DE COMANDOS    \r\n"
            "            Estudiante: Jimmy Stebym Rosero Barrera       \r\n"
            "==========================================================\r\n"
            "  H / h  -> MCO1 = HSI  (16 MHz) en PA8\r\n"
            "  L / l  -> MCO1 = LSE  (32.768 kHz) en PA8\r\n"
            "  P / p  -> MCO1 = PLL  (100 MHz / 4 = 25 MHz) en PA8\r\n"
            "  T / t  -> ajustar hora del RTC: escriba HH:MM:SS+ENTER,\r\n"
            "            o use el joystick (X=minutos, Y=horas,\r\n"
            "            click=salir)\r\n"
            "  F / f  -> ajustar fecha del RTC: escriba DD/MM/YY+ENTER,\r\n"
            "            o use el joystick (X=mes, Y=dia,\r\n"
            "            click=salir)\r\n"
            "  R / r  -> alterna reporte del sistema: ON = continuo\r\n"
            "            cada 300ms, R de nuevo lo apaga\r\n"
            "  (cualquier otra tecla reimprime este menu)\r\n"
            "Este menu se reenvia solo cada 30 s como recordatorio\r\n"
            "==========================================================\r\n\r\n";

    HAL_UART_Transmit(&huart2, (uint8_t *)msg_ayuda, strlen(msg_ayuda), HAL_MAX_DELAY);
}

/* -----------------------------------------------------------------------
 * REPORTE POR CONSOLA (comando 'R')
 * ----------------------------------------------------------------------- */
static void Enviar_Reporte(void)
{
    RTC_TimeTypeDef sTime = {0};
    RTC_DateTypeDef sDate = {0};
    char buffer_tx[220];

    /* hay que leer siempre time y date juntos para desbloquear el shadow register */
    HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);

    snprintf(buffer_tx, sizeof(buffer_tx),
             "\r\n=== REPORTE DEL SISTEMA ===\r\n"
             "  Fecha/Hora RTC : 20%02u-%02u-%02u  %02u:%02u:%02u\r\n"
             "  Joystick       : X=%4u  Y=%4u\r\n"
             "  MCO1 (PA8)     : %s\r\n"
             "  SYSCLK         : %lu Hz\r\n"
             "  Estado FSM     : %s\r\n\r\n",
             sDate.Year, sDate.Month, sDate.Date,
             sTime.Hours, sTime.Minutes, sTime.Seconds,
             joystick_x, joystick_y,
             MCO_FuenteTexto(mco_fuente_actual),
             (unsigned long)HAL_RCC_GetSysClockFreq(),
             (estado_fsm == ESTADO_MONITOR) ? "MONITOR" :
             (estado_fsm == ESTADO_CONFIG_RTC) ? "CONFIG_RTC" :
             (estado_fsm == ESTADO_CONFIG_FECHA) ? "CONFIG_FECHA" : "TETRIS");

