Stebym/stm32-course-jiroserob/examen_parcial/Src/main.c
    HAL_UART_Transmit(&huart2, (uint8_t *)buffer_tx, strlen(buffer_tx), 100);
}

/* -----------------------------------------------------------------------
 * APLICA LA HORA TECLEADA POR EL USUARIO (comando 'T')
 * Formato esperado: "HH:MM:SS" (tambien acepta "HH MM SS" separado por
 * espacios). Si el formato no calza, se ignora y no se toca el rtc.
 * ----------------------------------------------------------------------- */
static void RTC_AplicarEntradaUsuario(void)
{
    int hh = -1, mm = -1, ss = -1;

    if (sscanf(rtc_input_buffer, "%d:%d:%d", &hh, &mm, &ss) != 3)
    {
        sscanf(rtc_input_buffer, "%d %d %d", &hh, &mm, &ss);
    }

    if (hh >= 0 && hh <= 23 && mm >= 0 && mm <= 59 && ss >= 0 && ss <= 59)
    {
        RTC_TimeTypeDef sTime = {0};
        sTime.Hours   = (uint8_t)hh;
        sTime.Minutes = (uint8_t)mm;
        sTime.Seconds = (uint8_t)ss;
        HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    }
}

/* -----------------------------------------------------------------------
 * APLICA LA FECHA TECLEADA POR EL USUARIO (comando 'F')
 * Formato esperado: "DD/MM/YY" (tambien acepta "DD MM YY" separado por
 * espacios). Si el formato no calza, se ignora y no se toca el rtc.
 * El dia de la semana no se recalcula (no lo usa ninguna pantalla ni el
 * reporte), se deja fijo igual que en la inicializacion por defecto.
 * ----------------------------------------------------------------------- */
static void RTC_AplicarFechaTecleada(void)
{
    int dd = -1, mm = -1, yy = -1;

    if (sscanf(rtc_input_buffer, "%d/%d/%d", &dd, &mm, &yy) != 3)
    {
        sscanf(rtc_input_buffer, "%d %d %d", &dd, &mm, &yy);
    }

    if (dd >= 1 && dd <= 31 && mm >= 1 && mm <= 12 && yy >= 0 && yy <= 99)
    {
        RTC_DateTypeDef sDate = {0};
        sDate.WeekDay = RTC_WEEKDAY_MONDAY;
        sDate.Date    = (uint8_t)dd;
        sDate.Month   = (uint8_t)mm;
        sDate.Year    = (uint8_t)yy;
        HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
    }
}

/*
 * RTC_AjustarConJoystick
 * Alternativa al teclado dentro de ESTADO_CONFIG_RTC: empujar el joystick
 * en el eje Y (arriba/abajo) sube/baja los minutos: en el eje X
 * (izquierda/derecha) sube/baja las horas. Cada empujon cuenta como UN
 * paso -- hay que soltar el joystick de vuelta al centro antes de que se
 * cuente el siguiente, para no disparar decenas de pasos por segundo
 * mientras el ADC sigue muestreando cada 20 ms.
 */
static void RTC_AjustarConJoystick(void)
{
    int8_t delta_horas = 0, delta_minutos = 0;

    /* eje y: minutos */
    if (joystick_y >= JOY_UMBRAL_ALTO && joy_listo_paso_min) {
        delta_minutos = 1;
        joy_listo_paso_min = 0;
    } else if (joystick_y <= JOY_UMBRAL_BAJO && joy_listo_paso_min) {
        delta_minutos = -1;
        joy_listo_paso_min = 0;
    } else if (joystick_y >= JOY_CENTRO_MIN && joystick_y <= JOY_CENTRO_MAX) {
        joy_listo_paso_min = 1; /* de vuelta al centro: re-arma el siguiente paso */
    }

    /* eje x: horas */
    if (joystick_x >= JOY_UMBRAL_ALTO && joy_listo_paso_hora) {
        delta_horas = 1;
        joy_listo_paso_hora = 0;
    } else if (joystick_x <= JOY_UMBRAL_BAJO && joy_listo_paso_hora) {
        delta_horas = -1;
        joy_listo_paso_hora = 0;
    } else if (joystick_x >= JOY_CENTRO_MIN && joystick_x <= JOY_CENTRO_MAX) {
        joy_listo_paso_hora = 1;
    }

    if (delta_horas == 0 && delta_minutos == 0) {
        return; /* nada que ajustar todavia */
    }

    RTC_TimeTypeDef sTime = {0};
    RTC_DateTypeDef sDate = {0};
    HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN); /* desbloquea el shadow register */

    int16_t nueva_hora = (int16_t)sTime.Hours + delta_horas;
    int16_t nuevo_min  = (int16_t)sTime.Minutes + delta_minutos;

    if (nueva_hora < 0)  nueva_hora = 23;
    if (nueva_hora > 23) nueva_hora = 0;
    if (nuevo_min < 0)   nuevo_min = 59;
    if (nuevo_min > 59)  nuevo_min = 0;

    sTime.Hours   = (uint8_t)nueva_hora;
    sTime.Minutes = (uint8_t)nuevo_min;
    sTime.Seconds = 0; /* cada ajuste manual resincroniza los segundos a 0 */
    HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);

    OLED_ActualizarConfigRTC(); /* feedback inmediato del nuevo valor */
}

/*
 * RTC_AjustarFechaConJoystick
 * Alternativa al teclado dentro de ESTADO_CONFIG_FECHA: mismo patron "por
 * flanco" que RTC_AjustarConJoystick, pero eje X mueve el dia y eje Y
 * mueve el mes. Reutiliza joy_listo_paso_hora/joy_listo_paso_min porque
 * nunca esta activo al mismo tiempo que ESTADO_CONFIG_RTC (se re-arman
 * al entrar a cada estado).
 */
static void RTC_AjustarFechaConJoystick(void)
{
    int8_t delta_dia = 0, delta_mes = 0;

    /* eje x: dia */
    if (joystick_x >= JOY_UMBRAL_ALTO && joy_listo_paso_hora) {
        delta_dia = 1;
        joy_listo_paso_hora = 0;
    } else if (joystick_x <= JOY_UMBRAL_BAJO && joy_listo_paso_hora) {
        delta_dia = -1;
        joy_listo_paso_hora = 0;
    } else if (joystick_x >= JOY_CENTRO_MIN && joystick_x <= JOY_CENTRO_MAX) {
        joy_listo_paso_hora = 1;
    }

    /* eje y: mes */
    if (joystick_y >= JOY_UMBRAL_ALTO && joy_listo_paso_min) {
        delta_mes = 1;
        joy_listo_paso_min = 0;
    } else if (joystick_y <= JOY_UMBRAL_BAJO && joy_listo_paso_min) {
        delta_mes = -1;
        joy_listo_paso_min = 0;
    } else if (joystick_y >= JOY_CENTRO_MIN && joystick_y <= JOY_CENTRO_MAX) {
        joy_listo_paso_min = 1;
    }

    if (delta_dia == 0 && delta_mes == 0) {
        return; /* nada que ajustar todavia */
    }

    RTC_TimeTypeDef sTime = {0};
    RTC_DateTypeDef sDate = {0};
    HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN); /* desbloquea el shadow register */

    int16_t nuevo_dia = (int16_t)sDate.Date + delta_dia;
    int16_t nuevo_mes = (int16_t)sDate.Month + delta_mes;

    if (nuevo_dia < 1)  nuevo_dia = 31;
    if (nuevo_dia > 31) nuevo_dia = 1;
    if (nuevo_mes < 1)  nuevo_mes = 12;
    if (nuevo_mes > 12) nuevo_mes = 1;

    sDate.WeekDay = RTC_WEEKDAY_MONDAY;
    sDate.Date    = (uint8_t)nuevo_dia;
    sDate.Month   = (uint8_t)nuevo_mes;
    HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN);

    OLED_ActualizarConfigFecha(); /* feedback inmediato del nuevo valor */
}

/* -----------------------------------------------------------------------
 * PANTALLAS DEL OLED
 * ----------------------------------------------------------------------- */
static void OLED_ActualizarMonitor(void)
{
    RTC_TimeTypeDef sTime = {0};
    RTC_DateTypeDef sDate = {0};
    char linea[32];

    HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN); /* desbloquea el shadow register */

    SSD1306_Fill(0);

    snprintf(linea, sizeof(linea), "%02u:%02u:%02u  20%02u-%02u-%02u",
             sTime.Hours, sTime.Minutes, sTime.Seconds,
             sDate.Year, sDate.Month, sDate.Date);
    SSD1306_WriteString(0, 0, linea);

    snprintf(linea, sizeof(linea), "Joy X:%4u", joystick_x);
    SSD1306_WriteString(0, 16, linea);
    snprintf(linea, sizeof(linea), "Joy Y:%4u", joystick_y);
    SSD1306_WriteString(0, 26, linea);

