Stebym/stm32-course-jiroserob/examen_parcial/Src/main.c
    SSD1306_WriteString(0, 42, "Estado: MONITOR");

    snprintf(linea, sizeof(linea), "MCO1: %s", MCO_FuenteTexto(mco_fuente_actual));
    SSD1306_WriteString(0, 54, linea);

    /* cuadro subido hasta el techo (y=0) -- misma columna en x que antes,
     * solo cambia donde arranca en y. cursor "+" se mueve dentro segun la
     * posicion real del joystick. Nota: px se alimenta de joystick_y y py
     * de joystick_x (con el rango de py invertido) -- esto rota la lectura
     * 90 grados en sentido antihorario para que coincida con la
     * orientacion fisica real del modulo montado en la protoboard
     * (confirmado en hardware) */
    SSD1306_DrawEmptyRect(90, 6, 37, 47);

    /* joystick_x/joystick_y ya vienen filtrados y con zona muerta aplicada
     * desde HAL_ADC_ConvCpltCallback -- se ven quietos en reposo y solo
     * cambian con un movimiento real, tanto aqui como en Joy X/Joy Y y en
     * el reporte 'R' */
    uint8_t px = (uint8_t)Map(joystick_y, 0, 4095, 92, 124);
    uint8_t py = (uint8_t)Map(joystick_x, 0, 4095, 51, 8);
    SSD1306_DrawCross(px, py);

    SSD1306_UpdateScreen();
}

static void OLED_ActualizarConfigRTC(void)
{
    char linea[24];
    RTC_TimeTypeDef sTime = {0};
    RTC_DateTypeDef sDate = {0};

    HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN); /* desbloquea el shadow register */

    SSD1306_Fill(0);
    SSD1306_WriteString(0, 0, "CONFIG RTC");

    snprintf(linea, sizeof(linea), "Actual: %02u:%02u:%02u", sTime.Hours, sTime.Minutes, sTime.Seconds);
    SSD1306_WriteString(0, 12, linea);

    SSD1306_WriteString(0, 24, "Joystick: X=min Y=hr");
    SSD1306_WriteString(0, 34, "Teclado: HH:MM:SS+ENT");
    SSD1306_WriteString(0, 44, "Click = salir");

    snprintf(linea, sizeof(linea), "> %s", rtc_input_buffer);
    SSD1306_WriteString(0, 54, linea);

    SSD1306_UpdateScreen();
}

static void OLED_ActualizarConfigFecha(void)
{
    char linea[24];
    RTC_DateTypeDef sDate = {0};
    RTC_TimeTypeDef sTime = {0};

    HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN); /* desbloquea el shadow register */

    SSD1306_Fill(0);
    SSD1306_WriteString(0, 0, "CONFIG FECHA");

    snprintf(linea, sizeof(linea), "Actual: %02u/%02u/20%02u", sDate.Date, sDate.Month, sDate.Year);
    SSD1306_WriteString(0, 12, linea);

    SSD1306_WriteString(0, 24, "Joystick: X=mes Y=dia");
    SSD1306_WriteString(0, 34, "Teclado: DD/MM/YY+ENT");
    SSD1306_WriteString(0, 44, "Click = salir");

    snprintf(linea, sizeof(linea), "> %s", rtc_input_buffer);
    SSD1306_WriteString(0, 54, linea);

    SSD1306_UpdateScreen();
}

/* pantalla de bienvenida disparada por el click del joystick (pc0/exti0) */
static void OLED_MostrarBienvenida(void)
{
    SSD1306_Fill(0);
    SSD1306_WriteString(10, 8, "Examen Parcial V");
    SSD1306_WriteString(10, 20, "Jimmy Rosero B.");
    SSD1306_WriteString(10, 36, "Presiona Joys!");
    SSD1306_DrawEmptyRect(4, 4, 119, 55);
    SSD1306_UpdateScreen();
}

/* -----------------------------------------------------------------------
 * CALLBACKS DE INTERRUPCIONES DE LA HAL
 * ----------------------------------------------------------------------- */

/* tim10 desborda cada 250 ms -> alterna el led de estado (pa5) y su espejo (ph1) */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM10)
    {
        HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
        HAL_GPIO_TogglePin(GPIOH, GPIO_PIN_1);
    }
}

/* llega un byte nuevo por usart2 -> levanta la bandera y rearma la escucha */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        serial_nuevo = 1;
        HAL_UART_Receive_IT(&huart2, rx_data, 1);
    }
}

/* tim3_trgo dispara una conversion (cada 20 ms), el adc entrega rank1 y luego rank2 */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    if (hadc->Instance == ADC1)
    {
        uint16_t valor = (uint16_t)HAL_ADC_GetValue(&hadc1);

        if (adc_rank_actual == 0)
        {
            /* primer canal de la secuencia: rank1 = ch1 = pa1 = vry */
            filtro_adc_y += ((int32_t)valor - filtro_adc_y) / ADC_FILTRO_N;
            if (filtro_adc_y > JOY_CENTRO - JOY_ZONA_MUERTA && filtro_adc_y < JOY_CENTRO + JOY_ZONA_MUERTA) {
                joystick_y = JOY_CENTRO; /* dentro de la zona muerta: se ve quieto */
            } else {
                joystick_y = (uint16_t)filtro_adc_y;
            }
            adc_rank_actual = 1;
        }
        else
        {
            /* ultimo canal de la secuencia: rank2 = ch4 = pa4 = vrx. se rearma
             * aca para que el proximo tim3_trgo dispare la secuencia completa
             * otra vez desde el rank1, igual que se hace con un solo canal en
             * Tarea 3 */
            filtro_adc_x += ((int32_t)valor - filtro_adc_x) / ADC_FILTRO_N;
            if (filtro_adc_x > JOY_CENTRO - JOY_ZONA_MUERTA && filtro_adc_x < JOY_CENTRO + JOY_ZONA_MUERTA) {
                joystick_x = JOY_CENTRO;
            } else {
                joystick_x = (uint16_t)filtro_adc_x;
            }
            adc_rank_actual = 0;
            HAL_ADC_Start_IT(&hadc1);
        }
    }
}

/* click del joystick (pc0, flanco de bajada) -> levanta la bandera que saca
 * a la fsm de ESTADO_BIENVENIDA hacia ESTADO_MONITOR. debounce simple por
 * software (ignora un segundo flanco si llego muy rapido detras del
 * anterior). */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == GPIO_PIN_0)
    {
        uint32_t ahora = HAL_GetTick();
        if ((ahora - tick_ultimo_click) >= SW_DEBOUNCE_MS)
        {
            boton_sw_pulsado = 1;
            tick_ultimo_click = ahora;
        }
    }
}
